# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],  # 2
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   
   # ELAN 
   [-1, 1, Conv, [32, 1, 1]], # 4
   [-2, 1, Conv, [32, 1, 1]], # 5
   [-1, 1, Conv, [32, 3, 1]], # 6
   [-1, 1, Conv, [32, 3, 1]], # 7
   [-1, 1, Conv, [32, 3, 1]], # 8
   [-1, 1, Conv, [32, 3, 1]], # 9
   [[-1, -3, -5, -6], 1, Concat, [1]], # 10
   [-1, 1, Conv, [128, 1, 1]],  # 11
   
   # CSP
   [3, 1, Conv, [64, 1, 1]], # 11
   [[-1, -2], 1, Concat, [1]], # 12
  #  [-1, 1, Conv, [128, 1, 1]],  # 25

   # MP
   [-1, 1, MP, []], # 13
   [-1, 1, Conv, [128, 1, 1]], # 14
   [-3, 1, Conv, [128, 1, 1]], # 15
   [-1, 1, Conv, [128, 3, 2]], # 16
   [[-1, -3], 1, Concat, [1]],  # 17-P3/8  
   
   # ELAN
   [-1, 1, Conv, [64, 1, 1]], # 18
   [-2, 1, Conv, [64, 1, 1]], # 19
   [-1, 1, Conv, [64, 3, 1]], # 20
   [-1, 1, Conv, [64, 3, 1]], # 21
   [-1, 1, Conv, [64, 3, 1]], # 22
   [-1, 1, Conv, [64, 3, 1]], # 23
   [[-1, -3, -5, -6], 1, Concat, [1]], # 24
   [-1, 1, Conv, [256, 1, 1]],  # 25

   # CSP
   [17, 1, Conv, [128, 1, 1]], # 26
   [[-1, -2], 1, Concat, [1]], # 27
  #  [-1, 1, Conv, [256, 1, 1]],  # 25

   # MP
   [-1, 1, MP, []], # 28
   [-1, 1, Conv, [256, 1, 1]], # 29
   [-3, 1, Conv, [256, 1, 1]], # 30
   [-1, 1, Conv, [256, 3, 2]], # 31
   [[-1, -3], 1, Concat, [1]],  # 32-P4/16  
   
   # ELAN
   [-1, 1, Conv, [128, 1, 1]], # 33
   [-2, 1, Conv, [128, 1, 1]], # 34
   [-1, 1, Conv, [128, 3, 1]], # 35
   [-1, 1, Conv, [128, 3, 1]], # 36
   [-1, 1, Conv, [128, 3, 1]], # 37
   [-1, 1, Conv, [128, 3, 1]], # 38
   [[-1, -3, -5, -6], 1, Concat, [1]], # 39
   [-1, 1, Conv, [512, 1, 1]],  # 40

   # CSP
   [32, 1, Conv, [256, 1, 1]], # 41
   [[-1, -2], 1, Concat, [1]], # 42
  #  [-1, 1, Conv, [512, 1, 1]],  # 25
   
   # MP
   [-1, 1, MP, []], # 43
   [-1, 1, Conv, [512, 1, 1]], # 44
   [-3, 1, Conv, [512, 1, 1]], # 45
   [-1, 1, Conv, [512, 3, 2]], # 46
   [[-1, -3], 1, Concat, [1]],  # 47-P5/32  
   
   # ELAN
   [-1, 1, Conv, [256, 1, 1]], # 48
   [-2, 1, Conv, [256, 1, 1]], # 49
   [-1, 1, Conv, [256, 3, 1]], # 50
   [-1, 1, Conv, [256, 3, 1]], # 51
   [-1, 1, Conv, [256, 3, 1]], # 52
   [-1, 1, Conv, [256, 3, 1]], # 53
   [[-1, -3, -5, -6], 1, Concat, [1]], # 54
   [-1, 1, Conv, [1024, 1, 1]],  # 55

   # CSP
   [47, 1, Conv, [512, 1, 1]], # 56
   [[-1, -2], 1, Concat, [1]], # 57
   [-1, 1, Conv, [1024, 1, 1]], #59
  
  #  [-1, 1, Conv, [512, 1, 1]], #59
   [-1, 1, Classify, [360]] # 60
  ]

# head:
#   [[-1, 1, SPPCSPC, [512]], # 51
  
#    [-1, 1, Conv, [256, 1, 1]],
#    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#    [37, 1, Conv, [256, 1, 1]], # route backbone P4
#    [[-1, -2], 1, Concat, [1]],
   
#    [-1, 1, Conv, [256, 1, 1]],
#    [-2, 1, Conv, [256, 1, 1]],
#    [-1, 1, Conv, [128, 3, 1]],
#    [-1, 1, Conv, [128, 3, 1]],
#    [-1, 1, Conv, [128, 3, 1]],
#    [-1, 1, Conv, [128, 3, 1]],
#    [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
#    [-1, 1, Conv, [256, 1, 1]], # 63

  #  [-1, 1, Conv, [128, 1, 1]],
  #  [-1, 1, nn.Upsample, [None, 2, 'nearest']],
  #  [24, 1, Conv, [128, 1, 1]], # route backbone P3
  #  [[-1, -2], 1, Concat, [1]],
   
  #  [-1, 1, Conv, [128, 1, 1]],
  #  [-2, 1, Conv, [128, 1, 1]],
  #  [-1, 1, Conv, [64, 3, 1]],
  #  [-1, 1, Conv, [64, 3, 1]],
  #  [-1, 1, Conv, [64, 3, 1]],
  #  [-1, 1, Conv, [64, 3, 1]],
  #  [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
  #  [-1, 1, Conv, [128, 1, 1]], # 75
   
  #  [-1, 1, MP, []],
  #  [-1, 1, Conv, [128, 1, 1]],
  #  [-3, 1, Conv, [128, 1, 1]],
  #  [-1, 1, Conv, [128, 3, 2]],
  #  [[-1, -3, 63], 1, Concat, [1]],
   
  #  [-1, 1, Conv, [256, 1, 1]],
  #  [-2, 1, Conv, [256, 1, 1]],
  #  [-1, 1, Conv, [128, 3, 1]],
  #  [-1, 1, Conv, [128, 3, 1]],
  #  [-1, 1, Conv, [128, 3, 1]],
  #  [-1, 1, Conv, [128, 3, 1]],
  #  [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
  #  [-1, 1, Conv, [256, 1, 1]], # 88
      
  #  [-1, 1, MP, []],
  #  [-1, 1, Conv, [256, 1, 1]],
  #  [-3, 1, Conv, [256, 1, 1]],
  #  [-1, 1, Conv, [256, 3, 2]],
  #  [[-1, -3, 51], 1, Concat, [1]],
   
  #  [-1, 1, Conv, [512, 1, 1]],
  #  [-2, 1, Conv, [512, 1, 1]],
  #  [-1, 1, Conv, [256, 3, 1]],
  #  [-1, 1, Conv, [256, 3, 1]],
  #  [-1, 1, Conv, [256, 3, 1]],
  #  [-1, 1, Conv, [256, 3, 1]],
  #  [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
  #  [-1, 1, Conv, [512, 1, 1]], # 101
  

#    [75, 1, RepConv, [256, 3, 1]],
#    [88, 1, RepConv, [512, 3, 1]],
#    [101, 1, RepConv, [1024, 3, 1]],
   
#    [-1, 1, Classify, [360]], #101
#    [-3, 1, Classify, [360]], #88
#    [-5, 1, Classify, [360]], #75
#    [[-1, -2,-3], 1, Concat, [1]]
#   ]