# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],  # 2
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  

   # ELAN-MP 0 
   [-1, 1, Conv, [32, 1, 1]], # 4
   [-2, 1, Conv, [32, 1, 1]], # 5
   [-1, 1, Conv, [32, 3, 1]], # 6
   [-1, 1, Conv, [32, 3, 1]], # 7
   [-1, 1, Conv, [32, 3, 1]], # 8
   [-1, 1, Conv, [32, 3, 1]], # 9
   [[-1, -3, -5, -6], 1, Concat, [1]], # 10
   [-1, 1, Conv, [128, 1, 1]],  # 11
   [-1, 1, MP, []], # 12
   [-1, 1, Conv, [64, 1, 1]], # 13
   [-3, 1, Conv, [64, 1, 1]], # 14
   [-1, 1, Conv, [64, 3, 2]], # 15
   [[-1, -3], 1, Concat, [1]],  # 16

   # ELAN-MP 1 
   [3, 1, Conv, [32, 1, 1]], # 17
   [3, 1, Conv, [32, 1, 1]], # 18
   [-1, 1, Conv, [32, 3, 1]], # 19
   [-1, 1, Conv, [32, 3, 1]], # 20
   [-1, 1, Conv, [32, 3, 1]], # 21
   [-1, 1, Conv, [32, 3, 1]], # 22
   [[-1, -3, -5, -6], 1, Concat, [1]], # 23
   [-1, 1, Conv, [128, 1, 1]],  # 24
   [-1, 1, MP, []], # 25
   [-1, 1, Conv, [64, 1, 1]], # 26
   [-3, 1, Conv, [64, 1, 1]], # 27
   [-1, 1, Conv, [64, 3, 2]], # 28
   [[-1, -3], 1, Concat, [1]],  # 29

   # ELAN-MP 2 
   [-1, 1, Conv, [64, 1, 1]], # 30
   [-2, 1, Conv, [64, 1, 1]], # 31
   [-1, 1, Conv, [64, 3, 1]], # 32
   [-1, 1, Conv, [64, 3, 1]], # 33
   [-1, 1, Conv, [64, 3, 1]], # 34
   [-1, 1, Conv, [64, 3, 1]], # 35
   [[-1, -3, -5, -6], 1, Concat, [1]], # 36
   [-1, 1, Conv, [256, 1, 1]],  # 37
   [-1, 1, MP, []], # 38
   [-1, 1, Conv, [128, 1, 1]], # 39
   [-3, 1, Conv, [128, 1, 1]], # 40
   [-1, 1, Conv, [128, 3, 2]], # 41
   [[-1, -3], 1, Concat, [1]],  # 42

   # ELAN-MP 3 
   [-1, 1, Conv, [128, 1, 1]], # 43
   [-2, 1, Conv, [128, 1, 1]], # 44
   [-1, 1, Conv, [128, 3, 1]], # 45
   [-1, 1, Conv, [128, 3, 1]], # 46
   [-1, 1, Conv, [128, 3, 1]], # 47
   [-1, 1, Conv, [128, 3, 1]], # 48
   [[-1, -3, -5, -6], 1, Concat, [1]], # 49
   [-1, 1, Conv, [512, 1, 1]],  # 50
   [-1, 1, MP, []], # 51
   [-1, 1, Conv, [256, 1, 1]], # 52
   [-3, 1, Conv, [256, 1, 1]], # 53
   [-1, 1, Conv, [256, 3, 2]], # 54
   [[-1, -3], 1, Concat, [1]],  # 55

   # ELAN-MP 4 
   [-1, 1, Conv, [256, 1, 1]], # 56
   [-2, 1, Conv, [256, 1, 1]], # 57
   [-1, 1, Conv, [256, 3, 1]], # 58
   [-1, 1, Conv, [256, 3, 1]], # 59
   [-1, 1, Conv, [256, 3, 1]], # 60
   [-1, 1, Conv, [256, 3, 1]], # 61
   [[-1, -3, -5, -6], 1, Concat, [1]], # 62
   [-1, 1, Conv, [1024, 1, 1]],  # 63
   [-1, 1, MP, []], # 64
   [-1, 1, Conv, [512, 1, 1]], # 65
   [-3, 1, Conv, [512, 1, 1]], # 66
   [-1, 1, Conv, [512, 3, 2]], # 67
   [[-1, -3], 1, Concat, [1]],  # 68

   # ELAN-MP 5
   [-1, 1, Conv, [512, 1, 1]], # 69
   [-2, 1, Conv, [512, 1, 1]], # 70
   [-1, 1, Conv, [512, 3, 1]], # 71
   [-1, 1, Conv, [512, 3, 1]], # 72
   [-1, 1, Conv, [512, 3, 1]], # 73
   [-1, 1, Conv, [512, 3, 1]], # 74
   [[-1, -3, -5, -6], 1, Concat, [1]], # 75
   [-1, 1, Conv, [1024, 1, 1]],  # 76
   [-1, 1, MP, []], # 77
   [-1, 1, Conv, [512, 1, 1]], # 78
   [-3, 1, Conv, [512, 1, 1]], # 79
   [-1, 1, Conv, [512, 3, 2]], # 80
   [[-1, -3], 1, Concat, [1]],  # 81

   [-1, 1, nn.Upsample, [None, 16, 'bicubic']], # 82
   [29, 1, nn.Upsample, [None, 1, 'bicubic']], # 83
   [55, 1, nn.Upsample, [None, 4, 'bicubic']], # 84

   [[16, -3, -2, -1 ], 1, Concat, [1]], # 85
   
   [-1, 1, Conv, [896, 1, 1]], # 86
   [-2, 1, Conv, [896, 1, 1]], # 87
   [-1, 1, Conv, [896, 3, 1]], # 88
   [-1, 1, Conv, [896, 3, 1]], # 89
   [-1, 1, Conv, [896, 3, 1]], # 90
   [-1, 1, Conv, [896, 3, 1]], # 91
   [[-1, -3, -5, -6], 1, Concat, [1]], # 92
   [-1, 1, Conv, [896, 1, 1]],  # 93
   [-1, 1, MP, []], # 94
   [-1, 1, Conv, [896, 1, 1]], # 95
   [-3, 1, Conv, [896, 1, 1]], # 96
   [-1, 1, Conv, [896, 3, 2]], # 97
   [[-1, -3], 1, Concat, [1]],  # 98
   
   [-1, 1, Classify, [360]] # 99
  ]